# Практическая работа по уроку "Динамическая типизация"

#     Создайте переменные разных типов данных:
#   - Создайте переменную name и присвойте ей значение вашего имени (строка).
#   - Выведите значение переменной name на экран.
#   - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
#   - Выведите значение переменной age на экран.
#   - Перезапишите в age текущее значение переменной age + новое.
# Как неверно (просто перезапись на новое число):
# a = 15
# a = 17
#   - Выведите измененное значение переменной age на экран.
#   - Создайте переменную is_student и присвойте ей значение True (логическое значение).
#   - Выведите значение переменной is_student на экран.

# Пример результата выполнения программы:
# Name: John
# Age: 25
# New Age: 26
# Is Student: True

name = 'Natali'
print('Name:',name)
age = 37
print('Age:',age)
age = age+1
print('New age:', age)
is_student = True
print('Is Student:',is_student)
