# Практическое задание по теме: "Словари и множества"

# Цель: Написать программу на языке Python, используя Pycharm, для работы со словарями и множествами.

# 1. В проекте, где вы решаете домашние задания, создайте модуль 'module_1_6.py' и напишите весь код в нём.

# 2. Работа со словарями:
#   - Создайте переменную my_dict и присвойте ей словарь из нескольких пар ключ-значение.
# Например: Имя(str)-Год рождения(int).
#   - Выведите на экран словарь my_dict.
#   - Выведите на экран одно значение по существующему ключу, одно по отсутствующему из словаря my_dict без ошибки.
#   - Добавьте ещё две произвольные пары того же формата в словарь my_dict.
#  - Удалите одну из пар в словаре по существующему ключу из словаря my_dict и выведите значение из этой пары на экран.
#   - Выведите на экран словарь my_dict.

# 3. Работа с множествами:
#   - Создайте переменную my_set и присвойте ей множество, состоящее из разных типов данных с повторяющимися значениями.
#   - Выведите на экран множество my_set (должны отобразиться только уникальные значения).
#   - Добавьте 2 произвольных элемента в множество my_set, которых ещё нет.
#   - Удалите один любой элемент из множества my_set.
#   - Выведите на экран измененное множество my_set.

# Примечания:
# - Для вывода значений на экран используйте функцию print().
# - Помните, что словарь и множество - неупорядоченные коллекции.
# - Больше о методах словарей тут, множеств тут.

# Пример результата выполнения программы:
# Dict: {'Vasya': 1975, 'Egor': 1999, 'Masha': 2002}
# Existing value: 2002
# Not existing value: None
# Deleted value: 1999
# Modified dictionary: {'Vasya': 1975, 'Kamila': 1981, 'Artem': 1915, 'Masha': 2002}

# Set: {1, 'Яблоко', 42.314}
# Modified set: {'Яблоко', 42.314, 13, (5, 6, 1.6)}

my_dict = {'Andy': 1960, 'Nadin': 1978, 'Lucy': 1957, "Jane": 1989}
print('Dict:', my_dict)
print('Existing value:', my_dict['Lucy'])
print('Not existing value:', my_dict.get('Mike','Нет в списке'))
my_dict ['Helen']= 1967
my_dict ['Jane']= 1989
print('Deleted value:', my_dict.pop('Jane'))
print('Modified dictionary:', my_dict)

my_set = {9, 9, 8, 7, 8, 6, 'Cup', 5.5, 'Cup'}
print(my_set)
print(my_set.add('Spoon'), my_set.add(True))
print(my_set)
print(my_set.remove('Spoon'))
print(my_set)
